Table of Contents
 Class AbstractIdeaObject<T>
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class AbstractIdeaObject<T> : BimLinkObject, IIdeaObject, IEquatable<AbstractIdeaObject<T>> where T : IIdeaObject
Type Parameters
T
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<T>
Implements
IIdeaObject
IEquatable<AbstractIdeaObject<T>>
Derived
IdeaAnchorGrid
IdeaBend
IdeaBoltAssembly
IdeaBoltGrid
IdeaCombiInput
IdeaCombiItem
IdeaConcreteBlock
IdeaConnectedMember
IdeaConnectionPoint
IdeaCrossSectionByComponents
IdeaCrossSectionByName
IdeaCrossSectionByParameters
IdeaCut
IdeaElement1D
IdeaElement2D
IdeaFoldedPlate
IdeaLineSegment3D
IdeaLoadCase
IdeaLoadGroup
IdeaMaterialByName
IdeaMaterialConcrete
IdeaMaterialSteel
IdeaMember1D
IdeaMember2D
IdeaNegativePlate
IdeaNode
IdeaPlate
IdeaPolyLine3D
IdeaRegion3D
IdeaSpan
IdeaTaper
IdeaWeld
IdeaWorkPlane
Inherited Members
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 AbstractIdeaObject(Identifier<T>)
protected AbstractIdeaObject(Identifier<T> identifier)
Parameters
identifier Identifier<T>
Properties
 Id
Identification of the object. The ids of the objects are guaranteed to be unique withing the scope of the model and constant. See IIdeaObject interface comment for more details.
public string Id { get; }
Property Value
string
 Identifier
public Identifier<T> Identifier { get; }
Property Value
Identifier<T>
 Name
Name of the object, or null if the object does not have a name. The object name is not guaranteed to be defined or unique.
public virtual string Name { get; set; }
Property Value
string
Methods
 Equals(AbstractIdeaObject<T>)
Indicates whether the current object is equal to another object of the same type.
public bool Equals(AbstractIdeaObject<T> other)
Parameters
other AbstractIdeaObject<T>
An object to compare with this object.
Returns
bool
true if the current object is equal to the other parameter; otherwise, false.
 Equals(object)
Determines whether the specified object is equal to the current object.
public override bool Equals(object obj)
Parameters
obj object
The object to compare with the current object.
Returns
bool
true if the specified object is equal to the current object; otherwise, false.
 GetHashCode()
Serves as the default hash function.
public override int GetHashCode()
Returns
int
A hash code for the current object.
 Edit this page